"""

2. При вызове функции из 1 файла во втором, как исполняется общий код на создание файла?
Например, print() выведится хотя его не вызывал

3. Как сделать так, если в функции есть 6 переменных и мне нужно вытащить именно 1 из них?

4. Как то я не так сделал ветки, и при мердже в основную все комиты перешли на МАСТЕР, так и должно быть?
    Я сделал для мерджа:
        $ git checkout master
        $ git merge news
        $ git push origin master
        $ git branch -d news    <----- Удалил ветку локалько, поч?

5. Что значит все же SELF в классе - get_column_wider(self). ссылается на обект который его вызывает и с другим ИНИТ будет иной результат?

6. is_instant == True не нравится, но is_instant not is True не работает

7. ПОчему долго запускается приложение

8. Можно ли наследованием передать библиотеку?

9. Изучить super().__init__()

10. Изучить yield

11. Аннотации

12.
report_p_p_registry = ReportPaidPaymentRegistry()
PreCondition = PreCondition()
и т.д
Такие вызовы класса повторяются во всех модулях.
Что если вызвать все классы в отдельном модуле, а затем новоиспеченные переменные использовать в проекте?
Ускорит ли это работу кода
"""